{
  "protocolNumber": "8656/3860/1805/14-06-2016",
  "subject": "Α. Έγκριση των Τεχνικών Προδιαγραφών για την εκτέλεση τμηματικών εργασιών απόφραξης των αποχετευτικών εγκαταστάσεων των κτιρίων των Παιδικών Σταθμών, των Κεντρικών Υπηρεσιών Διοίκησης των χώρων των Μαγειρείων και όλων των  ιδιόκτητων κτιρίων του Δημοτικού Βρεφοκομείου Αθηνών προϋπολογισμών οικονομικών ετών 2016-2017, αποτελούμενες από:\n1. Την Γενική – Ειδική Συγγραφή Υποχρεώσεων. \n2. Την Τεχνική Έκθεση-Τεχνικές Περιγραφές.  \n3. Τον  Ενδεικτικό Προϋπολογισμό.\n4. Τον Προϋπολογισμό Προσφοράς, (για συμπλήρωση από τον  υποψήφιο προμηθευτή).\n5. Το  Τιμολόγιο Προσφοράς, (για συμπλήρωση από τον  υποψήφιο προμηθευτή).\nΤα ανωτέρω στοιχεία με αρίθμηση 1, 2, 4 & 5, αποτελούν τα συμβατικά στοιχεία της  εργασίας.\nB. Εκτέλεση τμηματικών εργασιών απόφραξης των αποχετευτικών εγκαταστάσεων των κτιρίων των Παιδικών Σταθμών, των Κεντρικών Υπηρεσιών Διοίκησης των χώρων των Μαγειρείων και όλων των  ιδιόκτητων κτιρίων του Δημοτικού Βρεφοκομείου Αθηνών προϋπολογισμών οικονομικών ετών 2016-2017, με την διαδικασία της απ’ ευθείας ανάθεσης, μετά από συλλογή σφραγισμένων προσφορών από το ελεύθερο εμπόριο και συμπλήρωση Προϋπολογισμού Προσφοράς και Τιμολογίου Προσφοράς και με κριτήριο κατακύρωσης την χαμηλότερη τιμή (χωρίς ΦΠΑ) για το σύνολο των εργασιών επί της τιμής του ενδεικτικού Προϋπολογισμού της Υπηρεσίας υπό την προϋπόθεση οι προσφερόμενες τιμές να ευρίσκονται εντός των τιμών του ενδεικτικού Προϋπολογισμού της Υπηρεσίας.",
  "issueDate": 1465862400000,
  "organizationId": "50381",
  "signerIds": [
    "100006823"
  ],
  "unitIds": [
    "82528"
  ],
  "decisionTypeId": "Ε.3",
  "thematicCategoryIds": [
    "20"
  ],
  "extraFieldValues": {
    "relatedDecisions": [],
    "documentType": "ΠΡΑΞΗ"
  },
  "privateData": false,
  "ada": "ΨΘ84ΟΡΙΑ-61Μ",
  "publishTimestamp": 1465905620397,
  "submissionTimestamp": 1465905620397,
  "versionId": "4a507964-9a1e-451b-96d5-dea846bc97f9",
  "status": "PUBLISHED",
  "url": "https://diavgeia.gov.gr/luminapi/api/decisions/ΨΘ84ΟΡΙΑ-61Μ",
  "documentUrl": "https://diavgeia.gov.gr/doc/ΨΘ84ΟΡΙΑ-61Μ",
  "documentChecksum": null,
  "attachments": [],
  "warnings": null,
  "correctedVersionId": null
}