<template>
  <div>
    <label :for="getExpenseCurrencyName">Συνάλλαγμα ποσού</label>
    <multiselect id="fek_issue" v-model="selected" :options="currencies" select-label="" selected-label="" deselect-label="" placeholder="">
    <span slot="noResult">Δεν βρέθηκε το συνάλλαγμα</span>
    </multiselect>
    <!-- Hack for vue-multiselect, based on this issue https://github.com/monterail/vue-multiselect/issues/299 -->
    <input type="hidden" :name="getExpenseCurrencyName" :value="selected">
  </div>
</template>

<script>

import Multiselect from 'vue-multiselect'

export default {
  props: ['number'],
  components: {Multiselect},
  data: () => {
    return {
      currencies: [
        'Ευρώ', 'Ντιράμ Ηνωμένων Αραβικών Εμιράτων', 'Αφγανί Αφγανιστάν', 'Λεκ Αλβανίας', 'Ντραμ Αρμενίας', 'Κουάνζα Ανγκόλας', 'Πέσο Αργεντινής', 'Δολάριο Αυστραλίας', 'Γκίλντα Αρούμπα', 'Μανάτ Αζερμπαϊτζάν', 'Μετατρέψιμο Μάρκο Βοσνίας-Ερζεγοβίνης', 'Δολάριο Μπαρμπάντος', 'Τάκα Μπαγκλαντές', 'Νέο Λεβ Βουλγαρίας', 'Δηνάριο Μπαχρέιν', 'Φράγκο Μπουρούντι', 'Δολάριο Βερμούδων', 'Δολάριο Μπρουνέι', 'Μπολιβιάνο Βολιβίας', 'Ρεάλ Βραζιλίας', 'Πούλα Μποτσουάνας', 'Ρούβλι Λευκορωσίας', 'Δολάριο Μπελίζ', 'Δολάριο Καναδά', 'Φράγκο Κονγκό', 'Φράγκο Ελβετίας', 'Πέσο Χιλής', 'Γιουάν Ρενμίμπι Κίνας', 'Πέσο Κολομβίας', 'Κολόν Κόστα Ρίκα', 'Εσκούδο Πράσινου Ακρωτηρίου', 'Κορόνα Τσέχικης Δημοκρατίας', 'Φράγκο Τζιμπουτί', 'Κορόνα Δανίας', 'Πέσο Δομίνικου', 'Δηνάριο Αλγερίας', 'Λίρα Αιγύπτου', 'Νάκφα Ερυθραίας', 'Μπιρ Αιθιοπίας', 'Λίρα Στερλίνα Βρετανίας', 'Λάρι Γεωργίας', 'Σέντι Γκάνας', 'Φράγκο Γουινέας', 'Κουετσάλ Γουατεμάλας', 'Δολάριο Γουιάνας', 'Δολάριο Χονγκ Κονγκ', 'Λεμπίρα Ονδούρας', 'Κούνα Κροατίας', 'Φιορίνι Ουγγαρίας', 'Ρούπια Ινδονησίας', 'Νέο Σέκελ Ισραήλ', 'Ρούπια Ινδίας', 'Δηνάριο Ιράκ', 'Ριάλ Ιράν', 'Κορόνα Ισλανδίας', 'Δολάριο Τζαμάικας', 'Δηνάριο Ιορδανίας', 'Γιεν Ιαπωνίας', 'Σελίνι Κένυας', 'Ρίελ Καμπότζης', 'Φράγκο Κομόρος', 'Γον Νότιας Κορέας', 'Δηνάριο Κουβέιτ', 'Τένγκε Καζακστάν', 'Λίρα Λιβάνου', 'Ρούπια Σρι Λάνκα', 'Δολάριο Λιβερίας', 'Λίτα Λιθουανίας', 'Λατς Λετονίας', 'Δηνάριο Λιβύης', 'Ντιράμ Μαρόκου', 'Λέι Μολδαβίας', 'Αριανί Μαδαγασκάρης', 'Δηνάριο Π.Γ.Δ.Μ.', 'Κυάτ Μιανμάρ', 'Πατάκα Μακάο', 'Ρούπια Μαυρικίου', 'Πέσο Μεξικού', 'Ρινγκίτ Μαλαισίας', 'Μετικάλ Μοζαμβίκης', 'Δολάριο Ναμίμπια', 'Νάιρα Νιγηρίας', 'Χρυσή Κόρδοβα Νικαράγουας', 'Κορόνα Νορβηγίας', 'Ρούπια Νεπάλ', 'Δολάριο Νέας Ζηλανδίας', 'Ριάλ Ομάν', 'Μπαλμπόα Παναμά', 'Νέο Σολ Περού', 'Πέσο Φιλιππίνων', 'Ρούπια Πακιστάν', 'Ζλότυ Πολωνίας', 'Γκουαρανί Παραγουάης', 'Ριάλ Κατάρ', 'Λεβ Ρουμανίας', 'Δηνάριο Σερβίας', 'Ρούβλι Ρωσίας', 'Φράγκο Ρουάντας', 'Ριάλ Σαουδικής Αραβίας', 'Λίρα Σουδάν', 'Κορόνα Σουηδίας', 'Δολάριο Σιγκαπούρης', 'Σελίνι Σομαλίας', 'Ντόμπρα Σάο Τομέ και Πρίνσιπε', 'Λίρα Συρίας', 'Μπατ Ταϊλάνδης', 'Δηνάριο Τυνησίας', 'Παάνγκα Τόνγκας', 'Τουρκική Λίρα', 'Δολάριο Τρινιντάντ και Τομπάγκο', 'Νέο Δολάριο Ταϊβάν', 'Σελίνι Τανζανίας', 'Χρίφνα Ουκρανίας', 'Σελίνι Ουγκάντας', 'Δολάριο ΗΠΑ', 'Πέσο Ουρουγουάης', 'Σομ Ουζμπεκιστάν', 'Βολιβάρ Φουέρτε Βενεζουέλας', 'Ντονγκ Βιετνάμ', 'Φράγκο Κεντρικής Αφρικής', 'Φράγκο Δυτικής Αφρικής', 'Ριάλ Υεμένης', 'Ραντ Νότιας Αφρικής', 'Κουάνζα Ζαΐρ'
      ],
      selected: ''
    }
  },
  computed: {
    getExpenseCurrencyName: function () {
      if (this.number !== undefined) {
        return 'expense[' + this.number + '][expense_currency]'
      }
      return 'expense_currency'
    }
  }
}
</script>
