<template>
  <div>
    <label for="normative_type">Τύπος Πράξης</label>
    <select class="selectpicker pickers" title="Τύπος Πράξης" data-live-search="true" id="normative_type_selector" name="normative_type" data-width="auto">
      <option v-for="normativeType in normativeTypes" :data-tokens="normativeType.keywords" :value="normativeType.text">{{normativeType.text}}</option>
    </select>
  </div>
</template>

<script>

import $ from 'jquery'

export default {
  data: () => {
    return {
      normativeTypes: [
        {text: 'Προεδρικό Διάταγμα', keywords: 'Προεδρικό Προεδρικο Διάταγμα Διαταγμα'},
        {text: 'Πράξη Πρωθυπουργού', keywords: 'Πράξη Πραξη Πρωθυπουργού Πρωθυπουργου'},
        {text: 'Κοινή Υπουργική Απόφαση', keywords: 'Κοινή Κοινη Υπουργική Υπουργικη Απόφαση Αποφαση'},
        {text: 'Υπουργική Απόφαση', keywords: 'Υπουργική Υπουργικη Απόφαση Αποφαση'},
        {text: 'Πράξη Ανεξάρτητης Αρχής', keywords: 'Πράξη Πραξη Ανεξάρτητης Ανεξαρτητης Αρχής Αρχης'},
        {text: 'Πράξη Γενικού / Ειδικού Γραμματέα Υπουργείου', keywords: 'Πράξη Πραξη Γενικού Γενικου Ειδικού Ειδικου Γραμματέα Γραμματεα Υπουργείου Υπουργειου'},
        {text: 'Πράξη Γενικού Γραμματέα Αποκεντρωμένης Διοίκησης', keywords: 'Πράξη Πραξη Γενικού Γενικου Γραμματέα Γραμματεα Αποκεντρωμένης Αποκεντρωμενης Διοίκησης Διοικησης'},
        {text: 'Πράξη Οργάνου Διοίκησης Ν.Π.Δ.Δ.', keywords: 'Πράξη Πραξη Οργάνου Οργανου Διοίκησης Διοικησης Ν.Π.Δ.Δ.'},
        {text: 'Πράξη Οργάνου Διοίκησης ΟΤΑ Α\' και Β\' Βαθμού (και εποπτευόμενων φορέων τους)', keywords: 'Πράξη Πραξη Οργάνου Οργανου Διοίκησης Διοικησης OTA A B Βαθμού Βαθμου Εποπτευόμενων Εποπτευομενων Φορέων Φορεων Και Τους'},
        {text: 'Πράξη Οργάνου Διοίκησης Φορέων Ευρύτερου Δημοσίου Τομέα', keywords: 'Πράξη Πραξη Οργάνου Οργανου Διοίκησης Διοικησης Φορέων Φορεων Ευρύτερου Ευρυτερου Δημοσίου Δημοσιου Τομέα Τομεα'},
        {text: 'Πράξη Προέδρου της Δημοκρατίας', keywords: 'Πράξη Πραξη Προέδρου Προεδρου Δημοκρατίας Δημοκρατιας Της'},
        {text: 'Πράξη Ρυθμιστικής Αρχής', keywords: 'Πράξη Πραξη Ρυθμιστικής Ρυθμιστικης Αρχής Αρχης'},
        {text: 'Πράξη Συλλογικού Κυβερνητικού Οργάνου', keywords: 'Πράξη Πραξη Συλλογικού Συλλογικου Κυβερνητικού Κυβερνητικου Οργάνου Οργανου'},
        {text: 'Διϋπουργική Απόφαση(ΔΕΕΑ)', keywords: 'Διϋπουργική Διϋπουργικη Διυπουργική Διυπουργικη Απόφαση Αποφαση ΔΕΕΑ'},
        {text: 'Πράξη Υπουργού, Αναπληρωτή Υπουργού, Υφυπουργού', keywords: 'Πράξη Πραξη Υπουργού Υπουργου Υφυπουργού Υφυπουργου'}
      ]
    }
  },
  mounted: function () {
    $('#normative_type_selector').selectpicker()
  }
}

</script>
