<template>
  <div class="decisionSpecificFields columns" style="padding-bottom:1.3em">
    <div class="column">
      <label for="spatial_planning_decision_type">Τύπος Πράξης</label>
      <multiselect v-model="selectedDecisionType" :options="decisionTypes" select-label="" selected-label="" deselect-label="" placeholder="">
      <span slot="noResult">Δεν βρέθηκε ο τύπος πράξης</span>
      </multiselect>
      <!-- Hack for vue-multiselect, based on this issue https://github.com/monterail/vue-multiselect/issues/299 -->
      <input type="hidden" name="spatial_planning_decision_type" :value="selectedDecisionType">
    </div>
    <div class="column">
      <label for="municipality">Γεωγραφική Περιοχή</label>
      <multiselect title="Επιλέξτε γεωγραφική περιοχή" required="required" v-model="selectedMunicipality" :options="municipalities" group-values="data" group-label="label" placeholder="Επιλέγετε γεωγραφική περιοχή" select-label="Πατήστε enter για επιλογή" selected-label="Επιλεγμένο" deselect-label="Πατήστε enter για αφαίρεση">
      <span slot="noResult">Δεν βρέθηκε η γεωγραφική περιοχή</span>
      </multiselect>
      <!-- Hack for vue-multiselect, based on this issue https://github.com/monterail/vue-multiselect/issues/299 -->
      <input type="hidden" name="municipality" :value="selectedMunicipality">
    </div>
  </div>
</template>

<script>

import Multiselect from 'vue-multiselect'

export default {
  data: () => {
    return {
      selectedDecisionType: '',
      decisionTypes: ['Έγκριση - τροποποίηση χωροταξικών και ρυμοτομικών σχεδίων','Αλλαγή χρήσης γης κοινόχρηστου κτήματος', 'Καθορισμός αιγιαλού, παραλίας, λιμνών, ποταμών, ρεμάτων και χειμάρων', 'Καθορισμός αρχαιολογικών χώρων', 'Καθορισμός βιομηχανικών ζωνών', 'Καθορισμός γης παραχωρούμενου δημόσιου κτήματος', 'Καθορισμός εθνικών δρυμών, δασών και δασικών εκτάσεων', 'Καθορισμός λατομικών ζωνών', 'Παραχώρηση δημόσιων και δημοτικών κτημάτων', 'Προσδιορισμός - τροποποίηση ορίων οικισμού και έγκριση μεταφοράς αυτόυ', 'Σύνταξη - έγκριση ζωνών οικιστικού ελέγχου (ΖΟΕ)', 'Σύνταξη - έγκριση πολεοδομικών μελετών και γενικού πολεοδομικού σχεδίου', 'Χαρακτηρισμός εκτάσεων ως αναδασωτέων', 'Χαρακτηρισμός κτιρίων ως διατηρητέων και αποχαρακτηρισμός αυτών', 'Χορήγηση - αναστολή - τροποποίηση οικοδομικών αδειών', 'Χωροθέτηση'],
      selectedMunicipality: '',
      municipalities: [
        {
          data: [
            'ΑΓΙΟ ΟΡΟΣ (ΑΥΤΟΔΙΟΙΚΗΤΟ)'
          ],
          label: 'ΑΓΙΟ ΟΡΟΣ (ΑΥΤΟΔΙΟΙΚΗΤΟ)'
        },
        {
          data: [
            'ΔΗΜΟΣ ΚΟΜΟΤΗΝΗΣ', 'ΔΗΜΟΣ ΑΡΡΙΑΝΩΝ', 'ΔΗΜΟΣ ΙΑΣΜΟΥ', 'ΔΗΜΟΣ ΜΑΡΩΝΕΙΑΣ - ΣΑΠΩΝ', 'ΔΗΜΟΣ ΔΡΑΜΑΣ', 'ΔΗΜΟΣ ΔΟΞΑΤΟΥ', 'ΔΗΜΟΣ ΚΑΤΩ ΝΕΥΡΟΚΟΠΙΟΥ', 'ΔΗΜΟΣ ΠΑΡΑΝΕΣΤΙΟΥ', 'ΔΗΜΟΣ ΠΡΟΣΟΤΣΑΝΗΣ', 'ΔΗΜΟΣ ΑΛΕΞΑΝΔΡΟΥΠΟΛΗΣ', 'ΔΗΜΟΣ ΔΙΔΥΜΟΤΕΙΧΟΥ', 'ΔΗΜΟΣ ΟΡΕΣΤΙΑΔΑΣ', 'ΔΗΜΟΣ ΣΑΜΟΘΡΑΚΗΣ', 'ΔΗΜΟΣ ΣΟΥΦΛΙΟΥ', 'ΔΗΜΟΣ ΘΑΣΟΥ', 'ΔΗΜΟΣ ΚΑΒΑΛΑΣ', 'ΔΗΜΟΣ ΝΕΣΤΟΥ', 'ΔΗΜΟΣ ΠΑΓΓΑΙΟΥ', 'ΔΗΜΟΣ ΞΑΝΘΗΣ', 'ΔΗΜΟΣ ΑΒΔΗΡΩΝ', 'ΔΗΜΟΣ ΜΥΚΗΣ', 'ΔΗΜΟΣ ΤΟΠΕΙΡΟΥ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΑΝΑΤΟΛΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ ΚΑΙ ΘΡΑΚΗΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΑΘΗΝΑΙΩΝ', 'ΔΗΜΟΣ ΒΥΡΩΝΟΣ', 'ΔΗΜΟΣ ΓΑΛΑΤΣΙΟΥ', 'ΔΗΜΟΣ ΔΑΦΝΗΣ - ΥΜΗΤΤΟΥ', 'ΔΗΜΟΣ ΖΩΓΡΑΦΟΥ', 'ΔΗΜΟΣ ΗΛΙΟΥΠΟΛΕΩΣ', 'ΔΗΜΟΣ ΚΑΙΣΑΡΙΑΝΗΣ', 'ΔΗΜΟΣ ΦΙΛΑΔΕΛΦΕΙΑΣ - ΧΑΛΚΗΔΟΝΟΣ', 'ΔΗΜΟΣ ΑΜΑΡΟΥΣΙΟΥ', 'ΔΗΜΟΣ ΑΓΙΑΣ ΠΑΡΑΣΚΕΥΗΣ', 'ΔΗΜΟΣ ΒΡΙΛΗΣΣΙΩΝ', 'ΔΗΜΟΣ ΗΡΑΚΛΕΙΟΥ', 'ΔΗΜΟΣ ΚΗΦΙΣΙΑΣ', 'ΔΗΜΟΣ ΛΥΚΟΒΡΥΣΗΣ - ΠΕΥΚΗΣ', 'ΔΗΜΟΣ ΜΕΤΑΜΟΡΦΩΣΕΩΣ', 'ΔΗΜΟΣ ΝΕΑΣ ΙΩΝΙΑΣ', 'ΔΗΜΟΣ ΠΑΠΑΓΟΥ - ΧΟΛΑΡΓΟΥ', 'ΔΗΜΟΣ ΠΕΝΤΕΛΗΣ', 'ΔΗΜΟΣ ΦΙΛΟΘΕΗΣ - ΨΥΧΙΚΟΥ', 'ΔΗΜΟΣ ΧΑΛΑΝΔΡΙΟΥ', 'ΔΗΜΟΣ ΠΕΡΙΣΤΕΡΙΟΥ', 'ΔΗΜΟΣ ΑΓΙΑΣ ΒΑΡΒΑΡΑΣ', 'ΔΗΜΟΣ ΑΓΙΩΝ ΑΝΑΡΓΥΡΩΝ - ΚΑΜΑΤΕΡΟΥ', 'ΔΗΜΟΣ ΑΙΓΑΛΕΩ', 'ΔΗΜΟΣ ΙΛΙΟΥ', 'ΔΗΜΟΣ ΠΕΤΡΟΥΠΟΛΕΩΣ', 'ΔΗΜΟΣ ΧΑΪΔΑΡΙΟΥ', 'ΔΗΜΟΣ ΚΑΛΛΙΘΕΑΣ', 'ΔΗΜΟΣ ΑΓΙΟΥ ΔΗΜΗΤΡΙΟΥ', 'ΔΗΜΟΣ ΑΛΙΜΟΥ', 'ΔΗΜΟΣ ΓΛΥΦΑΔΑΣ', 'ΔΗΜΟΣ ΕΛΛΗΝΙΚΟΥ - ΑΡΓΥΡΟΥΠΟΛΗΣ', 'ΔΗΜΟΣ ΜΟΣΧΑΤΟΥ - ΤΑΥΡΟΥ', 'ΔΗΜΟΣ ΝΕΑΣ ΣΜΥΡΝΗΣ', 'ΔΗΜΟΣ ΠΑΛΑΙΟΥ ΦΑΛΗΡΟΥ', 'ΔΗΜΟΣ ΑΧΑΡΝΩΝ', 'ΔΗΜΟΣ ΒΑΡΗΣ - ΒΟΥΛΑΣ - ΒΟΥΛΙΑΓΜΕΝΗΣ', 'ΔΗΜΟΣ ΔΙΟΝΥΣΟΥ', 'ΔΗΜΟΣ ΚΡΩΠΙΑΣ', 'ΔΗΜΟΣ ΛΑΥΡΕΩΤΙΚΗΣ', 'ΔΗΜΟΣ ΜΑΡΑΘΩΝΟΣ', 'ΔΗΜΟΣ ΜΑΡΚΟΠΟΥΛΟΥ ΜΕΣΟΓΑΙΑΣ', 'ΔΗΜΟΣ ΠΑΙΑΝΙΑΣ', 'ΔΗΜΟΣ ΠΑΛΛΗΝΗΣ', 'ΔΗΜΟΣ ΡΑΦΗΝΑΣ - ΠΙΚΕΡΜΙΟΥ', 'ΔΗΜΟΣ ΣΑΡΩΝΙΚΟΥ', 'ΔΗΜΟΣ ΣΠΑΤΩΝ - ΑΡΤΕΜΙΔΟΣ', 'ΔΗΜΟΣ ΩΡΩΠΟΥ', 'ΔΗΜΟΣ ΕΛΕΥΣΙΝΑΣ', 'ΔΗΜΟΣ ΑΣΠΡΟΠΥΡΓΟΥ', 'ΔΗΜΟΣ ΜΑΝΔΡΑΣ - ΕΙΔΥΛΛΙΑΣ', 'ΔΗΜΟΣ ΜΕΓΑΡΕΩΝ', 'ΔΗΜΟΣ ΦΥΛΗΣ', 'ΔΗΜΟΣ ΠΕΙΡΑΙΩΣ', 'ΔΗΜΟΣ ΚΕΡΑΤΣΙΝΙΟΥ - ΔΡΑΠΕΤΣΩΝΑΣ', 'ΔΗΜΟΣ ΚΟΡΥΔΑΛΛΟΥ', 'ΔΗΜΟΣ ΝΙΚΑΙΑΣ - ΑΓΙΟΥ ΙΩΑΝΝΗ ΡΕΝΤΗ', 'ΔΗΜΟΣ ΠΕΡΑΜΑΤΟΣ', 'ΔΗΜΟΣ ΣΑΛΑΜΙΝΟΣ', 'ΔΗΜΟΣ ΥΔΡΑΣ', 'ΔΗΜΟΣ ΑΓΚΙΣΤΡΙΟΥ', 'ΔΗΜΟΣ ΑΙΓΙΝΑΣ', 'ΔΗΜΟΣ ΚΥΘΗΡΩΝ', 'ΔΗΜΟΣ ΠΟΡΟΥ', 'ΔΗΜΟΣ ΣΠΕΤΣΩΝ', 'ΔΗΜΟΣ ΤΡΟΙΖΗΝΙΑΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΑΤΤΙΚΗΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΛΕΣΒΟΥ', 'ΔΗΜΟΣ ΙΚΑΡΙΑΣ', 'ΔΗΜΟΣ ΦΟΥΡΝΩΝ ΚΟΡΣΕΩΝ', 'ΔΗΜΟΣ ΛΗΜΝΟΥ', 'ΔΗΜΟΣ ΑΓΙΟΥ ΕΥΣΤΡΑΤΙΟΥ', 'ΔΗΜΟΣ ΣΑΜΟΥ', 'ΔΗΜΟΣ ΧΙΟΥ', 'ΔΗΜΟΣ ΟΙΝΟΥΣΣΩΝ', 'ΔΗΜΟΣ ΨΑΡΩΝ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΒΟΡΕΙΟΥ ΑΙΓΑΙΟΥ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΠΑΤΡΕΩΝ', 'ΔΗΜΟΣ ΑΙΓΙΑΛΕΙΑΣ', 'ΔΗΜΟΣ ΔΥΤΙΚΗΣ ΑΧΑΪΑΣ', 'ΔΗΜΟΣ ΕΡΥΜΑΝΘΟΥ', 'ΔΗΜΟΣ ΚΑΛΑΒΡΥΤΩΝ', 'ΔΗΜΟΣ ΙΕΡΑΣ ΠΟΛΗΣ ΜΕΣΟΛΟΓΓΙΟΥ', 'ΔΗΜΟΣ ΑΚΤΙΟΥ - ΒΟΝΙΤΣΑΣ', 'ΔΗΜΟΣ ΑΓΡΙΝΙΟΥ', 'ΔΗΜΟΣ ΑΜΦΙΛΟΧΙΑΣ', 'ΔΗΜΟΣ ΘΕΡΜΟΥ', 'ΔΗΜΟΣ ΝΑΥΠΑΚΤΙΑΣ', 'ΔΗΜΟΣ ΞΗΡΟΜΕΡΟΥ', 'ΔΗΜΟΣ ΠΥΡΓΟΥ', 'ΔΗΜΟΣ ΗΛΙΔΑΣ', 'ΔΗΜΟΣ ΑΝΔΡΑΒΙΔΑΣ - ΚΥΛΛΗΝΗΣ', 'ΔΗΜΟΣ ΑΝΔΡΙΤΣΑΙΝΑΣ - ΚΡΕΣΤΕΝΩΝ', 'ΔΗΜΟΣ ΑΡΧΑΙΑΣ ΟΛΥΜΠΙΑΣ', 'ΔΗΜΟΣ ΖΑΧΑΡΩΣ', 'ΔΗΜΟΣ ΠΗΝΕΙΟΥ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΔΥΤΙΚΗΣ ΕΛΛΑΔΑΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΚΟΖΑΝΗΣ', 'ΔΗΜΟΣ ΒΟΪΟΥ', 'ΔΗΜΟΣ ΕΟΡΔΑΙΑΣ', 'ΔΗΜΟΣ ΣΕΡΒΙΩΝ - ΒΕΛΒΕΝΤΟΥ', 'ΔΗΜΟΣ ΓΡΕΒΕΝΩΝ', 'ΔΗΜΟΣ ΔΕΣΚΑΤΗΣ', 'ΔΗΜΟΣ ΚΑΣΤΟΡΙΑΣ', 'ΔΗΜΟΣ ΝΕΣΤΟΡΙΟΥ', 'ΔΗΜΟΣ ΟΡΕΣΤΙΔΟΣ', 'ΔΗΜΟΣ ΦΛΩΡΙΝΑΣ', 'ΔΗΜΟΣ ΑΜΥΝΤΑΙΟΥ', 'ΔΗΜΟΣ ΠΡΕΣΠΩΝ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΔΥΤΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΙΩΑΝΝΙΤΩΝ', 'ΔΗΜΟΣ ΒΟΡΕΙΩΝ ΤΖΟΥΜΕΡΚΩΝ', 'ΔΗΜΟΣ ΔΩΔΩΝΗΣ', 'ΔΗΜΟΣ ΖΑΓΟΡΙΟΥ', 'ΔΗΜΟΣ ΖΙΤΣΑΣ', 'ΔΗΜΟΣ ΚΟΝΙΤΣΑΣ', 'ΔΗΜΟΣ ΜΕΤΣΟΒΟΥ', 'ΔΗΜΟΣ ΠΩΓΩΝΙΟΥ', 'ΔΗΜΟΣ ΑΡΤΑΙΩΝ', 'ΔΗΜΟΣ ΓΕΩΡΓΙΟΥ ΚΑΡΑΪΣΚΑΚΗ', 'ΔΗΜΟΣ ΚΕΝΤΡΙΚΩΝ ΤΖΟΥΜΕΡΚΩΝ', 'ΔΗΜΟΣ ΝΙΚΟΛΑΟΥ ΣΚΟΥΦΑ', 'ΔΗΜΟΣ ΗΓΟΥΜΕΝΙΤΣΑΣ', 'ΔΗΜΟΣ ΣΟΥΛΙΟΥ', 'ΔΗΜΟΣ ΦΙΛΙΑΤΩΝ', 'ΔΗΜΟΣ ΠΡΕΒΕΖΑΣ', 'ΔΗΜΟΣ ΖΗΡΟΥ', 'ΔΗΜΟΣ ΠΑΡΓΑΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΗΠΕΙΡΟΥ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΛΑΡΙΣΑΙΩΝ', 'ΔΗΜΟΣ ΑΓΙΑΣ', 'ΔΗΜΟΣ ΕΛΑΣΣΟΝΑΣ', 'ΔΗΜΟΣ ΚΙΛΕΛΕΡ', 'ΔΗΜΟΣ ΤΕΜΠΩΝ', 'ΔΗΜΟΣ ΤΥΡΝΑΒΟΥ', 'ΔΗΜΟΣ ΦΑΡΣΑΛΩΝ', 'ΔΗΜΟΣ ΚΑΡΔΙΤΣΑΣ', 'ΔΗΜΟΣ ΑΡΓΙΘΕΑΣ', 'ΔΗΜΟΣ ΛΙΜΝΗΣ ΠΛΑΣΤΗΡΑ', 'ΔΗΜΟΣ ΜΟΥΖΑΚΙΟΥ', 'ΔΗΜΟΣ ΠΑΛΑΜΑ', 'ΔΗΜΟΣ ΣΟΦΑΔΩΝ', 'ΔΗΜΟΣ ΒΟΛΟΥ', 'ΔΗΜΟΣ ΑΛΜΥΡΟΥ', 'ΔΗΜΟΣ ΖΑΓΟΡΑΣ - ΜΟΥΡΕΣΙΟΥ', 'ΔΗΜΟΣ ΝΟΤΙΟΥ ΠΗΛΙΟΥ', 'ΔΗΜΟΣ ΡΗΓΑ ΦΕΡΑΙΟΥ', 'ΔΗΜΟΣ ΣΚΙΑΘΟΥ', 'ΔΗΜΟΣ ΑΛΟΝΝΗΣΟΥ', 'ΔΗΜΟΣ ΣΚΟΠΕΛΟΥ', 'ΔΗΜΟΣ ΤΡΙΚΚΑΙΩΝ', 'ΔΗΜΟΣ ΚΑΛΑΜΠΑΚΑΣ', 'ΔΗΜΟΣ ΠΥΛΗΣ', 'ΔΗΜΟΣ ΦΑΡΚΑΔΟΝΑΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΘΕΣΣΑΛΙΑΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΚΕΡΚΥΡΑΣ', 'ΔΗΜΟΣ ΠΑΞΩΝ', 'ΔΗΜΟΣ ΖΑΚΥΝΘΟΥ', 'ΔΗΜΟΣ ΙΘΑΚΗΣ', 'ΔΗΜΟΣ ΚΕΦΑΛΟΝΙΑΣ', 'ΔΗΜΟΣ ΛΕΥΚΑΔΑΣ', 'ΔΗΜΟΣ ΜΕΓΑΝΗΣΙΟΥ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΙΟΝΙΩΝ ΝΗΣΩΝ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΘΕΣΣΑΛΟΝΙΚΗΣ', 'ΔΗΜΟΣ ΑΜΠΕΛΟΚΗΠΩΝ - ΜΕΝΕΜΕΝΗΣ', 'ΔΗΜΟΣ ΒΟΛΒΗΣ', 'ΔΗΜΟΣ ΔΕΛΤΑ', 'ΔΗΜΟΣ ΘΕΡΜΑΪΚΟΥ', 'ΔΗΜΟΣ ΘΕΡΜΗΣ', 'ΔΗΜΟΣ ΚΑΛΑΜΑΡΙΑΣ', 'ΔΗΜΟΣ ΚΟΡΔΕΛΙΟΥ - ΕΥΟΣΜΟΥ', 'ΔΗΜΟΣ ΛΑΓΚΑΔΑ', 'ΔΗΜΟΣ ΝΕΑΠΟΛΗΣ - ΣΥΚΕΩΝ', 'ΔΗΜΟΣ ΠΑΥΛΟΥ ΜΕΛΑ', 'ΔΗΜΟΣ ΠΥΛΑΙΑΣ - ΧΟΡΤΙΑΤΗ', 'ΔΗΜΟΣ ΧΑΛΚΗΔΟΝΟΣ', 'ΔΗΜΟΣ ΩΡΑΙΟΚΑΣΤΡΟΥ', 'ΔΗΜΟΣ ΒΕΡΟΙΑΣ', 'ΔΗΜΟΣ ΑΛΕΞΑΝΔΡΕΙΑΣ', 'ΔΗΜΟΣ ΝΑΟΥΣΑΣ', 'ΔΗΜΟΣ ΚΙΛΚΙΣ', 'ΔΗΜΟΣ ΠΑΙΟΝΙΑΣ', 'ΔΗΜΟΣ ΕΔΕΣΣΑΣ', 'ΔΗΜΟΣ ΑΛΜΩΠΙΑΣ', 'ΔΗΜΟΣ ΠΕΛΛΑΣ', 'ΔΗΜΟΣ ΣΚΥΔΡΑΣ', 'ΔΗΜΟΣ ΚΑΤΕΡΙΝΗΣ', 'ΔΗΜΟΣ ΔΙΟΥ - ΟΛΥΜΠΟΥ', 'ΔΗΜΟΣ ΠΥΔΝΑΣ - ΚΟΛΙΝΔΡΟΥ', 'ΔΗΜΟΣ ΣΕΡΡΩΝ', 'ΔΗΜΟΣ ΑΜΦΙΠΟΛΗΣ', 'ΔΗΜΟΣ ΒΙΣΑΛΤΙΑΣ', 'ΔΗΜΟΣ ΕΜΜΑΝΟΥΗΛ ΠΑΠΠΑ', 'ΔΗΜΟΣ ΗΡΑΚΛΕΙΑΣ', 'ΔΗΜΟΣ ΝΕΑΣ ΖΙΧΝΗΣ', 'ΔΗΜΟΣ ΣΙΝΤΙΚΗΣ', 'ΔΗΜΟΣ ΠΟΛΥΓΥΡΟΥ', 'ΔΗΜΟΣ ΑΡΙΣΤΟΤΕΛΗ', 'ΔΗΜΟΣ ΚΑΣΣΑΝΔΡΑΣ', 'ΔΗΜΟΣ ΝΕΑΣ ΠΡΟΠΟΝΤΙΔΑΣ', 'ΔΗΜΟΣ ΣΙΘΩΝΙΑΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΚΕΝΤΡΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΗΡΑΚΛΕΙΟΥ', 'ΔΗΜΟΣ ΑΡΧΑΝΩΝ - ΑΣΤΕΡΟΥΣΙΩΝ', 'ΔΗΜΟΣ ΒΙΑΝΝΟΥ', 'ΔΗΜΟΣ ΓΟΡΤΥΝΑΣ', 'ΔΗΜΟΣ ΜΑΛΕΒΙΖΙΟΥ', 'ΔΗΜΟΣ ΜΙΝΩΑ ΠΕΔΙΑΔΑΣ', 'ΔΗΜΟΣ ΦΑΙΣΤΟΥ', 'ΔΗΜΟΣ ΧΕΡΣΟΝΗΣΟΥ', 'ΔΗΜΟΣ ΑΓΙΟΥ ΝΙΚΟΛΑΟΥ', 'ΔΗΜΟΣ ΙΕΡΑΠΕΤΡΑΣ', 'ΔΗΜΟΣ ΟΡΟΠΕΔΙΟΥ ΛΑΣΙΘΙΟΥ', 'ΔΗΜΟΣ ΣΗΤΕΙΑΣ', 'ΔΗΜΟΣ ΡΕΘΥΜΝΗΣ', 'ΔΗΜΟΣ ΑΓΙΟΥ ΒΑΣΙΛΕΙΟΥ', 'ΔΗΜΟΣ ΑΜΑΡΙΟΥ', 'ΔΗΜΟΣ ΑΝΩΓΕΙΩΝ', 'ΔΗΜΟΣ ΜΥΛΟΠΟΤΑΜΟΥ', 'ΔΗΜΟΣ ΧΑΝΙΩΝ', 'ΔΗΜΟΣ ΑΠΟΚΟΡΩΝΟΥ', 'ΔΗΜΟΣ ΓΑΥΔΟΥ', 'ΔΗΜΟΣ ΚΑΝΤΑΝΟΥ - ΣΕΛΙΝΟΥ', 'ΔΗΜΟΣ ΚΙΣΣΑΜΟΥ', 'ΔΗΜΟΣ ΠΛΑΤΑΝΙΑ', 'ΔΗΜΟΣ ΣΦΑΚΙΩΝ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΚΡΗΤΗΣ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΣΥΡΟΥ - ΕΡΜΟΥΠΟΛΗΣ', 'ΔΗΜΟΣ ΑΝΔΡΟΥ', 'ΔΗΜΟΣ ΘΗΡΑΣ', 'ΔΗΜΟΣ ΑΝΑΦΗΣ', 'ΔΗΜΟΣ ΙΗΤΩΝ', 'ΔΗΜΟΣ ΣΙΚΙΝΟΥ', 'ΔΗΜΟΣ ΦΟΛΕΓΑΝΔΡΟΥ', 'ΔΗΜΟΣ ΚΑΛΥΜΝΙΩΝ', 'ΔΗΜΟΣ ΑΓΑΘΟΝΗΣΙΟΥ', 'ΔΗΜΟΣ ΑΣΤΥΠΑΛΑΙΑΣ', 'ΔΗΜΟΣ ΛΕΙΨΩΝ', 'ΔΗΜΟΣ ΛΕΡΟΥ', 'ΔΗΜΟΣ ΠΑΤΜΟΥ', 'ΔΗΜΟΣ ΚΑΡΠΑΘΟΥ', 'ΔΗΜΟΣ ΚΑΣΟΥ', 'ΔΗΜΟΣ ΚΕΑΣ', 'ΔΗΜΟΣ ΚΥΘΝΟΥ', 'ΔΗΜΟΣ ΚΩ', 'ΔΗΜΟΣ ΝΙΣΥΡΟΥ', 'ΔΗΜΟΣ ΜΗΛΟΥ', 'ΔΗΜΟΣ ΚΙΜΩΛΟΥ', 'ΔΗΜΟΣ ΣΕΡΙΦΟΥ', 'ΔΗΜΟΣ ΣΙΦΝΟΥ', 'ΔΗΜΟΣ ΜΥΚΟΝΟΥ', 'ΔΗΜΟΣ ΑΜΟΡΓΟΥ', 'ΔΗΜΟΣ ΝΑΞΟΥ ΚΑΙ ΜΙΚΡΩΝ ΚΥΚΛΑΔΩΝ', 'ΔΗΜΟΣ ΠΑΡΟΥ', 'ΔΗΜΟΣ ΑΝΤΙΠΑΡΟΥ', 'ΔΗΜΟΣ ΡΟΔΟΥ', 'ΔΗΜΟΣ ΜΕΓΙΣΤΗΣ', 'ΔΗΜΟΣ ΣΥΜΗΣ', 'ΔΗΜΟΣ ΤΗΛΟΥ', 'ΔΗΜΟΣ ΧΑΛΚΗΣ', 'ΔΗΜΟΣ ΤΗΝΟΥ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΝΟΤΙΟΥ ΑΙΓΑΙΟΥ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΤΡΙΠΟΛΗΣ', 'ΔΗΜΟΣ ΒΟΡΕΙΑΣ ΚΥΝΟΥΡΙΑΣ', 'ΔΗΜΟΣ ΓΟΡΤΥΝΙΑΣ', 'ΔΗΜΟΣ ΜΕΓΑΛΟΠΟΛΗΣ', 'ΔΗΜΟΣ ΝΟΤΙΑΣ ΚΥΝΟΥΡΙΑΣ', 'ΔΗΜΟΣ ΝΑΥΠΛΙΕΩΝ', 'ΔΗΜΟΣ ΑΡΓΟΥΣ - ΜΥΚΗΝΩΝ', 'ΔΗΜΟΣ ΕΠΙΔΑΥΡΟΥ', 'ΔΗΜΟΣ ΕΡΜΙΟΝΙΔΑΣ', 'ΔΗΜΟΣ ΚΟΡΙΝΘΙΩΝ', 'ΔΗΜΟΣ ΒΕΛΟΥ - ΒΟΧΑΣ', 'ΔΗΜΟΣ ΛΟΥΤΡΑΚΙΟΥ - ΑΓΙΩΝ ΘΕΟΔΩΡΩΝ', 'ΔΗΜΟΣ ΝΕΜΕΑΣ', 'ΔΗΜΟΣ ΞΥΛΟΚΑΣΤΡΟΥ - ΕΥΡΩΣΤΙΝΗΣ', 'ΔΗΜΟΣ ΣΙΚΥΩΝΙΩΝ', 'ΔΗΜΟΣ ΣΠΑΡΤΗΣ', 'ΔΗΜΟΣ ΑΝΑΤΟΛΙΚΗΣ ΜΑΝΗΣ', 'ΔΗΜΟΣ ΕΛΑΦΟΝΗΣΟΥ', 'ΔΗΜΟΣ ΕΥΡΩΤΑ', 'ΔΗΜΟΣ ΜΟΝΕΜΒΑΣΙΑΣ', 'ΔΗΜΟΣ ΚΑΛΑΜΑΤΑΣ', 'ΔΗΜΟΣ ΔΥΤΙΚΗΣ ΜΑΝΗΣ', 'ΔΗΜΟΣ ΜΕΣΣΗΝΗΣ', 'ΔΗΜΟΣ ΟΙΧΑΛΙΑΣ', 'ΔΗΜΟΣ ΠΥΛΟΥ - ΝΕΣΤΟΡΟΣ', 'ΔΗΜΟΣ ΤΡΙΦΥΛΙΑΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΠΕΛΟΠΟΝΝΗΣΟΥ'
        },
        {
          data: [
            'ΔΗΜΟΣ ΛΑΜΙΕΩΝ', 'ΔΗΜΟΣ ΑΜΦΙΚΛΕΙΑΣ - ΕΛΑΤΕΙΑΣ', 'ΔΗΜΟΣ ΔΟΜΟΚΟΥ', 'ΔΗΜΟΣ ΛΟΚΡΩΝ', 'ΔΗΜΟΣ ΜΑΚΡΑΚΩΜΗΣ', 'ΔΗΜΟΣ ΜΩΛΟΥ - ΑΓΙΟΥ ΚΩΝΣΤΑΝΤΙΝΟΥ', 'ΔΗΜΟΣ ΣΤΥΛΙΔΟΣ', 'ΔΗΜΟΣ ΛΕΒΑΔΕΩΝ', 'ΔΗΜΟΣ ΑΛΙΑΡΤΟΥ', 'ΔΗΜΟΣ ΔΙΣΤΟΜΟΥ - ΑΡΑΧΟΒΑΣ - ΑΝΤΙΚΥΡΑΣ', 'ΔΗΜΟΣ ΘΗΒΑΙΩΝ', 'ΔΗΜΟΣ ΟΡΧΟΜΕΝΟΥ', 'ΔΗΜΟΣ ΤΑΝΑΓΡΑΣ', 'ΔΗΜΟΣ ΧΑΛΚΙΔΕΩΝ', 'ΔΗΜΟΣ ΔΙΡΦΥΩΝ - ΜΕΣΣΑΠΙΩΝ', 'ΔΗΜΟΣ ΕΡΕΤΡΙΑΣ', 'ΔΗΜΟΣ ΙΣΤΙΑΙΑΣ - ΑΙΔΗΨΟΥ', 'ΔΗΜΟΣ ΚΑΡΥΣΤΟΥ', 'ΔΗΜΟΣ ΚΥΜΗΣ - ΑΛΙΒΕΡΙΟΥ', 'ΔΗΜΟΣ ΜΑΝΤΟΥΔΙΟΥ - ΛΙΜΝΗΣ - ΑΓΙΑΣ ΑΝΝΑΣ', 'ΔΗΜΟΣ ΣΚΥΡΟΥ', 'ΔΗΜΟΣ ΚΑΡΠΕΝΗΣΙΟΥ', 'ΔΗΜΟΣ ΑΓΡΑΦΩΝ', 'ΔΗΜΟΣ ΔΕΛΦΩΝ', 'ΔΗΜΟΣ ΔΩΡΙΔΟΣ'
          ],
          label: 'ΠΕΡΙΦΕΡΕΙΑ ΣΤΕΡΕΑΣ ΕΛΛΑΔΑΣ'
        }
      ]
    }
  },
  components: {Multiselect}
}
</script>
